roundTracker/backend/app/controllers/rounds_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "charlie"], ["LIMIT", 1]]
SELECT "rounds".* FROM "rounds" WHERE "rounds"."user_id" = ?  [["user_id", 1]]
---
    def index
        user = User.find_by(username: params[:username])
        rounds = Round.where(:user_id => user.id)

SELECT "hole_rounds".* FROM "hole_rounds" WHERE "hole_rounds"."round_id" = ?  [["round_id", 2]]
---
    def new_round

        user = User.find_by(username: params[:username])
        hole_rounds = params[:hole_rounds]
        p hole_rounds
        round = Round.create(name: params[:name], length: params[:length], user_id: user.id, course_id: params[:course][:id])
        hole_rounds.each{|hole|

SELECT "hole_rounds".* FROM "hole_rounds" WHERE "hole_rounds"."round_id" = ?  [["round_id", 2]]
SELECT "rounds".* FROM "rounds" WHERE "rounds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "hole_rounds" WHERE "hole_rounds"."id" = ?  [["id", 19]]
DELETE FROM "rounds" WHERE "rounds"."id" = ?  [["id", 2]]
---
    def destroy
        round = Round.find_by(id: params[:id])
        round.destroy()

SELECT "rounds".* FROM "rounds" WHERE "rounds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "rounds" SET "name" = ?, "updated_at" = ? WHERE "rounds"."id" = ?  [["name", "MYROUND"], ["updated_at", "2021-01-27 21:41:51.308580"], ["id", 1]]
---
    def update
        round = Round.find(params[:id])
        #round.update(name: params[:name], score: params[:score])
        round.update(name: params[:name])