roundTracker/backend/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "lucas"], ["created_at", "2021-01-26 00:19:07.800247"], ["updated_at", "2021-01-26 00:19:07.800247"]]
---
    def create
        user = User.create(username: params[:username])

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "lucas"], ["LIMIT", 1]]
---
    def login
        user = User.find_by(username: params[:username])